app/Controllers/Barang.php

    public function index()
    {
        $isAdmin = $this->isAdmin();
        $isKepalaPembelian = $this->isKepalaPembelian();

        $barang = $this->ModelBarang->findAll();
        $stok_barang = [];

        foreach ($barang as $item) {
            $barang_masuk = $this->ModelDetailPenerimaan->where('kode_barang', $item['kode_barang'])->findAll();
            $barang_keluar = $this->ModelDetailPengeluaran->where('kode_barang', $item['kode_barang'])->findAll();
---
SELECT *
FROM `barang`
SELECT *
FROM `detail_penerimaan`
WHERE `kode_barang` = 'BRG101'
SELECT *
FROM `detail_pengeluaran`
WHERE `kode_barang` = 'BRG101'

    public function qr_code($kode_barang)
    {
        // Ambil data barang berdasarkan kode barang
        $barang = $this->ModelBarang->where('kode_barang', $kode_barang)->first();
---
SELECT *
FROM `barang`
WHERE `kode_barang` = 'BRG101'
 LIMIT 1