app/Controllers/Dashboard.php

SELECT COUNT(*) AS `numrows`
FROM `permintaan`
SELECT COUNT(*) AS `numrows`
FROM `pengeluaran`
SELECT COUNT(*) AS `numrows`
FROM `pengadaan`
SELECT COUNT(*) AS `numrows`
FROM `penerimaan`
---
    public function admin()
    {
        $modelPermintaan = new ModelPermintaan();
        $modelPengeluaran = new ModelPengeluaran();
        $modelPengadaan = new ModelPengadaan();
        $modelPenerimaan = new ModelPenerimaan();
        if (!$this->isAdmin()) {
            return redirect()->to('/auth'); // Redirect jika bukan admin
        }

        $data = [
            'permintaanCount' => $modelPermintaan->countAllResults(),
            'pengeluaranCount' => $modelPengeluaran->countAllResults(),
            'pengadaanCount' => $modelPengadaan->countAllResults(),
            'penerimaanCount' => $modelPenerimaan->countAllResults(),
            'isAdmin' => true // Atau gunakan nilai sesuai kebutuhan
        ];