app/Controllers/Login.php

    public function login()
    {
        $session = session();
        $username = $this->request->getVar('username');
        $password = $this->request->getVar('password');
        $data = $this->ModelUser->where('username', $username)->first();
---
SELECT *
FROM `user`
WHERE `username` = 'admin'
 LIMIT 1