app/Controllers/Penerimaan.php

    public function tambahdata()
    {
        $pengadaan = $this->ModelPengadaan->select('pengadaan.*')
        ->join('penerimaan', 'penerimaan.kode_po = pengadaan.kode_po', 'left')
        ->where('penerimaan.kode_po IS NULL')
        ->where('pengadaan.status', 1)
        ->findAll();
---
SELECT `pengadaan`.*
FROM `pengadaan`
LEFT JOIN `penerimaan` ON `penerimaan`.`kode_po` = `pengadaan`.`kode_po`
WHERE `penerimaan`.`kode_po` IS NULL
AND `pengadaan`.`status` = 1