app/Controllers/Pengeluaran.php

    public function index()
    {
        $isAdmin = $this->isAdmin();

        $pengeluaran = $this->ModelPengeluaran->findAll();
        $detail_pengeluaran = [];

        foreach ($pengeluaran as $out) {
            $detail_pengeluaran[$out['kode_pengeluaran']] = $this->ModelDetailPengeluaran->AllData($out['kode_pengeluaran']);
        }

        $permintaan = $this->ModelPermintaan->findAll();
---
SELECT *
FROM `pengeluaran`
SELECT *
FROM `permintaan`

    public function tambahdata()
    {
        $permintaan = $this->ModelPermintaan->select('permintaan.*')
        ->join('pengeluaran', 'pengeluaran.kode_permintaan = permintaan.kode_permintaan', 'left')
        ->where('pengeluaran.kode_permintaan IS NULL')
        ->where('permintaan.status', '1')
        ->like('permintaan.kode_permintaan', 'PRO%', 'after')
        ->findAll();
---
SELECT `permintaan`.*
FROM `permintaan`
LEFT JOIN `pengeluaran` ON `pengeluaran`.`kode_permintaan` = `permintaan`.`kode_permintaan`
WHERE `pengeluaran`.`kode_permintaan` IS NULL
AND `permintaan`.`status` = '1'
AND  `permintaan`.`kode_permintaan` LIKE 'PRO%%' ESCAPE '!'