app/Controllers/Pengadaan.php

    public function index()
    {
        $isAdmin = $this->isAdmin();
        $isKepalaPembelian = $this->isKepalaPembelian();

        $pengadaan = $this->ModelPengadaan->findAll();
---
SELECT *
FROM `pengadaan`

    public function tambahdata()
    {
        $permintaan = $this->ModelPermintaan->like('kode_permintaan', 'PO%', 'after')->findAll();
---
SELECT *
FROM `permintaan`
WHERE `kode_permintaan` LIKE 'PO%%' ESCAPE '!'