app/Controllers/Permintaan.php

SELECT *
FROM `permintaan`
---
    public function index()
    {
        $isAdmin = $this->isAdmin();
        $isKepalaGudang = $this->isKepalaGudang();
        $isKepalaProduksi = $this->isKepalaProduksi();

        $permintaan = $this->ModelPermintaan->findAll();