app/Controllers/User.php

SELECT *
FROM `user`
---
    public function index()
    {
        $isAdmin = $this->isAdmin();
        $user = $this->ModelUser->findAll();