app/Models/ModelBarang.php

SELECT *
FROM `barang`
---
    public function AllData()
    {
        return $this->findAll();