app/Models/ModelDetailPermintaan.php

SELECT *
FROM `detail_permintaan`
JOIN `barang` ON `barang`.`kode_barang`=`detail_permintaan`.`kode_barang`
WHERE `detail_permintaan`.`kode_permintaan` = 'PO0001'
ORDER BY `detail_permintaan`.`kode_barang` DESC
---
    public function AllData($kode_permintaan = null)
    {
        $builder = $this->db->table('detail_permintaan')
            ->join('barang', 'barang.kode_barang=detail_permintaan.kode_barang')
            ->orderBy('detail_permintaan.kode_barang', 'DESC');

        if (!empty($kode_permintaan)) {
            $builder->where('detail_permintaan.kode_permintaan', $kode_permintaan);
        }

        return $builder
            ->get()
            ->getResultArray();

SELECT *
FROM `detail_permintaan`
JOIN `barang` ON `barang`.`kode_barang`=`detail_permintaan`.`kode_barang`
WHERE `detail_permintaan`.`kode_permintaan` IS NULL
---
    public function getByKodePRM($kode_permintaan)
    {
        return $this->db->table($this->table)
                        ->join('barang', 'barang.kode_barang=detail_permintaan.kode_barang')
                        ->where('detail_permintaan.kode_permintaan', $kode_permintaan)
                        ->get()
                        ->getResultArray();