app/Models/ModelPengeluaran.php

    public function AllData()
    {
        return $this->db->table('pengeluaran')
            ->join('permintaan', 'permintaan.kode_permintaan=permintaan.kode_permintaan')
            ->orderBy('kode_pengeluaran', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `pengeluaran`
JOIN `permintaan` ON `permintaan`.`kode_permintaan`=`permintaan`.`kode_permintaan`
ORDER BY `kode_pengeluaran` DESC

    public function generateKodePRO()
    {
        $prefix = 'PRO-' . date('Ymd') . '-';

        $kodeTerbesar = $this->db->table('pengeluaran')
            ->select('kode_pengeluaran')
            ->like('kode_pengeluaran', $prefix, 'after')
            ->orderBy('kode_pengeluaran', 'desc')
            ->get()
            ->getRowArray();
---
SELECT `kode_pengeluaran`
FROM `pengeluaran`
WHERE `kode_pengeluaran` LIKE 'PRO-20240808-%' ESCAPE '!'
ORDER BY `kode_pengeluaran` DESC