app/Models/ModelDetailPenukaran.php

    public function getRepairCount($kode_barang)
    {
        return $this->db->table('detail_penukaran')
            ->selectSum('jumlah_penukaran', 'total_repair')
            ->where('kode_barang', $kode_barang)
            ->like('alasan_penukaran', 'repair', 'both')
            ->get()
            ->getRowArray();
---
SELECT SUM(`jumlah_penukaran`) AS `total_repair`
FROM `detail_penukaran`
WHERE `kode_barang` = 'BRG101'
AND  `alasan_penukaran` LIKE '%repair%' ESCAPE '!'

    public function getRejectCount($kode_barang)
    {
        return $this->db->table('detail_penukaran')
            ->selectSum('jumlah_penukaran', 'total_reject')
            ->where('kode_barang', $kode_barang)
            ->like('alasan_penukaran', 'reject', 'both')
            ->get()
            ->getRowArray();
---
SELECT SUM(`jumlah_penukaran`) AS `total_reject`
FROM `detail_penukaran`
WHERE `kode_barang` = 'BRG101'
AND  `alasan_penukaran` LIKE '%reject%' ESCAPE '!'