app/Models/ModelDetailPenerimaan.php

    public function AllData($kode_penerimaan = null)
    {
        $builder = $this->db->table('detail_penerimaan')
            ->join('barang', 'barang.kode_barang=detail_penerimaan.kode_barang')
            ->orderBy('detail_penerimaan.kode_barang', 'DESC');

        if (!empty($kode_penerimaan)) {
            $builder->where('detail_penerimaan.kode_penerimaan', $kode_penerimaan);
        }

        return $builder
            ->get()
            ->getResultArray();
---
SELECT *
FROM `detail_penerimaan`
JOIN `barang` ON `barang`.`kode_barang`=`detail_penerimaan`.`kode_barang`
ORDER BY `detail_penerimaan`.`kode_barang` DESC