app/Models/ModelDetailPengeluaran.php

    public function AllData($kode_pengeluaran = null)
    {
        $builder = $this->db->table('detail_pengeluaran')
            ->join('barang', 'barang.kode_barang=detail_pengeluaran.kode_barang')
            ->orderBy('detail_pengeluaran.kode_barang', 'DESC');

        if (!empty($kode_pengeluaran)) {
            $builder->where('detail_pengeluaran.kode_pengeluaran', $kode_pengeluaran);
        }

        return $builder
            ->get()
            ->getResultArray();
---
SELECT *
FROM `detail_pengeluaran`
JOIN `barang` ON `barang`.`kode_barang`=`detail_pengeluaran`.`kode_barang`
WHERE `detail_pengeluaran`.`kode_pengeluaran` = 'PRO-20240713-001'
ORDER BY `detail_pengeluaran`.`kode_barang` DESC