app/Models/ModelPengadaan.php

    public function AllData()
    {
        return $this->db->table('pengadaan')
            ->join('permintaan', 'permintaan.kode_permintaan=permintaan.kode_permintaan')
            ->where('permintaan.type_permintaan','PENGADAAN')
            ->orderBy('kode_po', 'DESC')
            ->get()
            ->getResultArray();
---
SELECT *
FROM `pengadaan`
JOIN `permintaan` ON `permintaan`.`kode_permintaan`=`permintaan`.`kode_permintaan`
WHERE `permintaan`.`type_permintaan` = 'PENGADAAN'
ORDER BY `kode_po` DESC

    public function hapusdata($kode_po)
    {
        $this->db->table('pengadaan')->where('kode_po', $kode_po)->delete();
---
DELETE FROM `pengadaan`
WHERE `kode_po` = ('PO-20240720-003')

    public function getLaporan($start_date, $end_date)
    {
        return $this->where('tanggal_pengadaan >=', $start_date)
                    ->where('tanggal_pengadaan <=', $end_date)
                    ->findAll();
---
SELECT *
FROM `pengadaan`
WHERE `tanggal_pengadaan` >= '2024-07-03'
AND `tanggal_pengadaan` <= '2024-07-03'

    public function getDetailPengadaan($kode_po)
    {
        return $this->db->table('detail_pengadaan')
                        ->join('barang', 'barang.kode_barang=detail_pengadaan.kode_barang')
                        ->where('kode_po', $kode_po)
                        ->get()
                        ->getResultArray();
---
SELECT *
FROM `detail_pengadaan`
JOIN `barang` ON `barang`.`kode_barang`=`detail_pengadaan`.`kode_barang`
WHERE `kode_po` = 'BELIXXX30JUN24'

    public function findByKodePO($kode_po)
    {
        return $this->where('kode_po', $kode_po)
                    ->first();
---
SELECT *
FROM `pengadaan`
WHERE `kode_po` = 'PO-20240713-001'
 LIMIT 1

    public function findSupplier($kode_po)
    {
        return $this->db->table($this->table)
                        ->select('nama_supplier')
                        ->where('kode_po', $kode_po)
                        ->get()
                        ->getRowArray();
---
SELECT `nama_supplier`
FROM `pengadaan`
WHERE `kode_po` = 'PO-20240713-001'