app/Models/ModelPermintaan.php

SELECT *
FROM `permintaan`
ORDER BY `kode_permintaan` ASC
---
    public function AllData()
    {
        return $this->orderBy('kode_permintaan', 'ASC')
                    ->findAll();