app/Models/ModelPermintaan.php

SELECT *
FROM `permintaan`
---
    public function AllData()
    {
        return $this->findAll();

SELECT `kode_permintaan`
FROM `permintaan`
WHERE `kode_permintaan` LIKE 'PRO%%' ESCAPE '!'
ORDER BY `kode_permintaan` DESC
 LIMIT 1
---
    public function ubahdata($data)
    {
        $this->db->table('permintaan')->where('kode_permintaan', $data['kode_permintaan'])->update($data);

SELECT *
FROM `permintaan`
WHERE `kode_permintaan` = 'PO0010'
 LIMIT 1
---
    public function getDetailPermintaan($kode_permintaan)
    {
        return $this->db->table('detail_permintaan')
                        ->where('kode_permintaan', $kode_permintaan)
                        ->get()
                        ->getResultArray();