app/Models/ModelPenerimaan.php

SELECT *
FROM `penerimaan`
JOIN `pengadaan` ON `pengadaan`.`kode_po`=`pengadaan`.`kode_po`
ORDER BY `kode_penerimaan` DESC
---
    public function AllData()
    {
        return $this->db->table('penerimaan')
            ->join('pengadaan', 'pengadaan.kode_po=pengadaan.kode_po')
            ->orderBy('kode_penerimaan', 'DESC')
            ->get()
            ->getResultArray();

SELECT `kode_penerimaan`
FROM `penerimaan`
WHERE `kode_penerimaan` LIKE 'TRM-20240808-%' ESCAPE '!'
ORDER BY `kode_penerimaan` DESC
---
    public function generateKodeTRM()
    {
        $prefix = 'TRM-' . date('Ymd') . '-';

        // Dapatkan kode PO terbesar berdasarkan prefix hari ini
        $kodeTerbesar = $this->db->table('penerimaan')
            ->select('kode_penerimaan')
            ->like('kode_penerimaan', $prefix, 'after')
            ->orderBy('kode_penerimaan', 'desc')
            ->get()
            ->getRowArray();