app/Models/ModelDetailPengadaan.php

SELECT *
FROM `detail_pengadaan`
JOIN `barang` ON `barang`.`kode_barang`=`detail_pengadaan`.`kode_barang`
WHERE `detail_pengadaan`.`kode_po` = 'PO-20240713-001'
ORDER BY `detail_pengadaan`.`kode_barang` DESC
---
    public function AllData($kode_po = null)
    {
        $builder = $this->db->table('detail_pengadaan')
            ->join('barang', 'barang.kode_barang=detail_pengadaan.kode_barang')
            ->orderBy('detail_pengadaan.kode_barang', 'DESC');

        if (!empty($kode_po)) {
            $builder->where('detail_pengadaan.kode_po', $kode_po);
        }

        return $builder
            ->get()
            ->getResultArray();

SELECT *
FROM `detail_pengadaan`
JOIN `barang` ON `barang`.`kode_barang`=`detail_pengadaan`.`kode_barang`
WHERE `detail_pengadaan`.`kode_po` = 'PO-20240720-003'
---
    public function getByKodePO($kode_po)
    {
        return $this->db->table($this->table)
                        ->join('barang', 'barang.kode_barang=detail_pengadaan.kode_barang')
                        ->where('detail_pengadaan.kode_po', $kode_po)
                        ->get()
                        ->getResultArray();