app/Models/ModelUser.php

SELECT *
FROM `user`
WHERE `id_user` = '5'
 LIMIT 1
---
    public function getUserById($id_user)
    {
        return $this->where('id_user', $id_user)->first(); // Sesuaikan dengan query yang sesuai

DELETE FROM `user`
WHERE `id_user` = '6'
AND `id_user` = '6'
---
    public function hapusdata($data)
    {
        $this->db->table('user')->where('id_user', $data['id_user'])->delete($data);